[
  {
    "role": "laura",
    "text": "I mean if you meet someone ",
    "time": "00:02"
  },
  {
    "role": "laura",
    "text": "You can do it ",
    "time": "00:02"
  },
  {
    "role": "you",
    "text": "I'm thinking about you riding me baby... your body trembling with pleasure 😏 I wanna hold that perfect ass and fuck you so bad",
    "time": "00:03"
  },
  {
    "role": "you",
    "text": "Why? How could you be okay with me doing that with someone else?",
    "time": "00:04"
  },
  {
    "role": "laura",
    "text": "Well honey I know im not there ",
    "time": "00:04"
  },
  {
    "role": "you",
    "text": "What about you baby? Would you wanna do it with another guy if you felt like it?",
    "time": "00:05"
  },
  {
    "role": "laura",
    "text": "Im talking about you ",
    "time": "00:05"
  },
  {
    "role": "laura",
    "text": "For Men is more hard than for woman ",
    "time": "00:05"
  },
  {
    "role": "you",
    "text": "Don't worry baby, I just jerk off thinking about you haha 😏",
    "time": "00:07"
  },
  {
    "role": "laura",
    "text": "Haha yes but ",
    "time": "00:07"
  },
  {
    "role": "laura",
    "text": "Do you ever think if we are going to meet? ",
    "time": "00:07"
  },
  {
    "role": "you",
    "text": "Wait, are you just saying that so you don't have to send videos? haha",
    "time": "00:07"
  },
  {
    "role": "laura",
    "text": "No ",
    "time": "00:07"
  },
  {
    "role": "you",
    "text": "Yeah I think we will haha Don't you wanna meet me?",
    "time": "00:08"
  },
  {
    "role": "laura",
    "text": "I say this because this Time that im getting to know you, it seems like you are very sexual, so ig you want to have sex with Someone else you can ",
    "time": "00:08"
  },
  {
    "role": "laura",
    "text": "I want to meet you but i dont know if that is going to happen ",
    "time": "00:09"
  },
  {
    "role": "you",
    "text": "I love sex and I thought you did too, so I guess I've been really open about it haha Are you feeling like it's a bit too much for you? But baby, I only think about doing it with you 🤍",
    "time": "00:10"
  },
  {
    "role": "laura",
    "text": "I think about you too, à lot ",
    "time": "00:10"
  },
  {
    "role": "you",
    "text": "So you're not sure if we can meet... yeah I understand baby",
    "time": "00:11"
  },
  {
    "role": "laura",
    "text": "But I dont want to be selfish, Thats Why if you really want to have sex and you have the opportunity to have it you can do it ",
    "time": "00:11"
  }
]