[
  {
    "role": "michelle",
    "text": "Actually i don't like to use make up i just promote them but i don't use make up, I only use it sometimes if there is an event at work 😆 ",
    "time": "2026-02-11 19:37"
  },
  {
    "role": "michelle",
    "text": "Ohh okayy got it, what is your work? if you don't mind",
    "time": "2026-02-11 19:37"
  },
  {
    "role": "you",
    "text": "haha that's actually kinda funny, selling makeup you don't even use\n\noh my work - i work at a traditional cultural organization, like helping run events and ceremonies and stuff. it's pretty niche haha\n\nand then i do music production on the side when i have time",
    "time": "2026-02-11 19:40"
  },
  {
    "role": "michelle",
    "text": "yes, because other people will look down on me because the beauty standard here is to be naturally beautiful haha",
    "time": "2026-02-11 19:43"
  },
  {
    "role": "michelle",
    "text": "ohhh your work can be exhausting i can feel it even though it's not my job 😂",
    "time": "2026-02-11 19:43"
  },
  {
    "role": "michelle",
    "text": "Do you like hip hop? ",
    "time": "2026-02-11 19:43"
  },
  {
    "role": "you",
    "text": "ah yeah that's interesting, the natural beauty thing. kinda different from here where everyone's into makeup\n\nhaha yeah the work can be rough but it's fine, you get used to it\n\nand yeah i like hip hop! i listen to a lot of different stuff but hip hop's definitely in there. you into it?",
    "time": "2026-02-11 19:50"
  },
  {
    "role": "michelle",
    "text": "ohh okayy, I think makeup is common in China, Korea and there, and honestly there is no problem with makeup it helps to boost a person's confidence, but it's different here when you use it people will look down on you haha ",
    "time": "2026-02-11 19:57"
  },
  {
    "role": "michelle",
    "text": "that's cool, i also like hiphop since i was 17 years old, because at our school there are often activities about hiphop ",
    "time": "2026-02-11 19:57"
  },
  {
    "role": "you",
    "text": "yeah it's weird how beauty standards are so different everywhere. like here everyone's trying to look a certain way with makeup and stuff, but it sounds kinda stressful if people judge you for using it there\n\noh nice though, hip hop since 17! what kind of activities? like dance battles or music stuff?",
    "time": "2026-02-11 20:02"
  },
  {
    "role": "michelle",
    "text": "oh yes, every country has different beauty standards, so I just think that if I'm not attractive here, maybe I'll be attractive in another country 😂 ",
    "time": "2026-02-11 20:09"
  },
  {
    "role": "michelle",
    "text": "actually both, we do dance battle and music battle every month at school",
    "time": "2026-02-11 20:09"
  },
  {
    "role": "you",
    "text": "haha i mean you're probably attractive in a lot of places, just saying 😏\n\nwait dance AND music battles every month?? that's sick honestly. did you compete or just watch? \n\ni'm trying to imagine a cosmetics sales lady who can dance battle lmao",
    "time": "2026-02-11 20:14"
  },
  {
    "role": "michelle",
    "text": "oh thankyou for that 😁",
    "time": "2026-02-11 20:19"
  },
  {
    "role": "michelle",
    "text": " yes every month there is a dance and music battle at school here, i participate since i like to dance and sing. half of my time at school is practice for dancing 😂",
    "time": "2026-02-11 20:19"
  },
  {
    "role": "you",
    "text": "wait half your time?? 😂\n\nthat's commitment honestly. so you were like actually serious about it, not just messing around\n\ndo you still dance now or was that just a school thing?",
    "time": "2026-02-11 20:22"
  },
  {
    "role": "michelle",
    "text": "yes, our PE time lasts almost half the time of school hours 😂  ",
    "time": "2026-02-11 20:29"
  },
  {
    "role": "michelle",
    "text": "i still do dancing in competitions here in our area but if there is no competition i don't dance anymore haha",
    "time": "2026-02-11 20:29"
  },
  {
    "role": "you",
    "text": "wait so PE was like half your school day?? that's wild haha\n\noh nice so you still compete sometimes. what kind of competitions? like local street dance stuff or more organized events?",
    "time": "2026-02-11 20:37"
  },
  {
    "role": "michelle",
    "text": "yes, at our school, we are mentally and physically exhausted because of the activities 😂  ",
    "time": "2026-02-11 20:43"
  },
  {
    "role": "michelle",
    "text": "sometimes local street competition but often more organized events",
    "time": "2026-02-11 20:43"
  },
  {
    "role": "you",
    "text": "haha yeah i can imagine, dancing that much is no joke\n\noh cool so you actually compete in real events, that's pretty legit. when's the last time you did one?\n\nand do you still practice much or just kinda show up when there's a comp? 😂",
    "time": "2026-02-11 20:49"
  },
  {
    "role": "michelle",
    "text": "the last time i participated in the competition was last December in our municipality at the event there, Me and my other dance club friends won because the dance we did there was the one we danced at our school graduation so we didn't need to practice too much because we were already good at it haha ",
    "time": "2026-02-11 20:56"
  },
  {
    "role": "michelle",
    "text": "When there's an upcoming competition, I practice too much, especially when there are new dance moves that I need to learn 😂",
    "time": "2026-02-11 20:56"
  },
  {
    "role": "you",
    "text": "oh wait you won last december?? that's actually really cool, especially reusing the graduation dance haha, smart move\n\nand yeah i feel that, new choreography takes so much practice to get right. do you guys choreograph it yourselves or does someone teach you?",
    "time": "2026-02-11 21:50"
  },
  {
    "role": "michelle",
    "text": "oh yes exactly haha, actually what we do is I first learn the dance moves in advance, then after i learn i teach them haha",
    "time": "2026-02-11 21:58"
  },
  {
    "role": "michelle",
    "text": "maybe but for me I'm not a good dancer I just did my best and I just enjoyed dancing and didn't think i was in a competition so I didn't put pressure on myself 😂",
    "time": "2026-02-11 22:30"
  },
  {
    "role": "michelle",
    "text": "I don't have a bf, and the guys here are strict forward if they like the girl they will tell the girl immediately no matter what the girl is. someone is pursuing me here but i rejected him because he is too arrogant ",
    "time": "2026-02-11 22:34"
  },
  {
    "role": "you",
    "text": "oh interesting, so guys here are pretty direct huh\n\nhaha yeah arrogant guys are the worst. like there's confidence and then there's just... too much\n\nso you're single then? not really looking or just haven't found the right person yet?",
    "time": "2026-02-11 22:39"
  },
  {
    "role": "michelle",
    "text": "yes, im still single because i don't like the attitude of the men here, most of them are arrogant so if you rejected them they will tell you that \"youre lucky because i chose you but you rejected me\" I experienced that with four men as if it was my fault that they confessed to me 😂",
    "time": "2026-02-11 22:42"
  }
]