[
  {
    "role": "you",
    "text": "haha yeah smart move. life's too short to waste on people who don't get it",
    "time": "2026-02-12 11:13"
  },
  {
    "role": "michelle",
    "text": "actually ramen with rice is really my go-to, especially when I'm tired 😂",
    "time": "2026-02-12 11:27"
  },
  {
    "role": "you",
    "text": "haha ramen and rice together, that's a solid combo honestly. do you go for instant ramen or the real stuff from a shop?",
    "time": "2026-02-12 11:44"
  },
  {
    "role": "michelle",
    "text": "haha yeah, it's really a solid combo 😂 sometimes i go for instant ramen, but more often i get the real stuff from a shop. \n",
    "time": "2026-02-12 11:52"
  },
  {
    "role": "michelle",
    "text": "what time did you usually go for lunch ",
    "time": "2026-02-12 11:53"
  },
  {
    "role": "you",
    "text": "usually around 12 or 12:30, depends on work stuff\n\nwhy, you hungry? haha",
    "time": "2026-02-12 12:16"
  },
  {
    "role": "michelle",
    "text": "ohh okayy i see haha, no  i usually eat lunch at 1pm because our break time is 1pm haha",
    "time": "2026-02-12 12:25"
  },
  {
    "role": "you",
    "text": "ah makes sense, that's pretty late lunch though haha. you must get pretty hungry by then",
    "time": "2026-02-12 12:36"
  },
  {
    "role": "michelle",
    "text": "yes, that's why before I leave the house I make sure I'm full so I'm not too hungry before break time haha",
    "time": "2026-02-12 12:53"
  },
  {
    "role": "you",
    "text": "haha smart, basically carb loading before work\n\ndo you cook or just like eat a big breakfast?",
    "time": "2026-02-12 13:03"
  },
  {
    "role": "michelle",
    "text": "I cook, I always eat for breakfast and dinner, but for lunch I eat at the mall because I only have a 30 minute break at work haha",
    "time": "2026-02-12 13:19"
  },
  {
    "role": "you",
    "text": "ahh makes sense, 30 minutes isn't much time to do anything haha. what do you usually get at the mall?",
    "time": "2026-02-12 13:28"
  },
  {
    "role": "michelle",
    "text": "hmm.. you mean for lunch? sometimes at mcdonalds but often jollibee",
    "time": "2026-02-12 14:42"
  },
  {
    "role": "you",
    "text": "ah jollibee, i've heard about that place actually haha. never been though since we don't have it here",
    "time": "2026-02-12 14:51"
  },
  {
    "role": "michelle",
    "text": "oh yes, but this is just a Filipino version of mcdo so they don't have anything different, maybe just the taste of gravy and ketchup 😂",
    "time": "2026-02-12 14:55"
  },
  {
    "role": "you",
    "text": "haha the gravy and ketchup make that much of a difference?",
    "time": "2026-02-12 15:31"
  },
  {
    "role": "michelle",
    "text": "yes for me, jollibee's gravy and ketchup are tastier than mcdo's haha",
    "time": "2026-02-12 16:00"
  },
  {
    "role": "you",
    "text": "haha fair enough, guess the condiments really do matter then",
    "time": "2026-02-12 16:20"
  },
  {
    "role": "michelle",
    "text": "yea yea, i'm on my way home now i'm only at work for half a day today haha",
    "time": "2026-02-12 16:23"
  },
  {
    "role": "you",
    "text": "oh nice, heading home early then haha. going straight to the beach after or just relaxing at home?",
    "time": "2026-02-12 16:47"
  },
  {
    "role": "michelle",
    "text": "I went to my grandma's house to cook dinner for her and I just finished cleaning the house 😂",
    "time": "2026-02-12 18:18"
  },
  {
    "role": "you",
    "text": "oh that's really sweet of you, taking care of your grandma like that. you're a good granddaughter haha",
    "time": "2026-02-12 18:23"
  },
  {
    "role": "michelle",
    "text": "yes I do this to her every day since I don't want my grandma to get tired, she should just relax all the time haha",
    "time": "2026-02-12 18:25"
  },
  {
    "role": "you",
    "text": "that's really sweet, she's lucky to have you haha. must be tiring some days though?",
    "time": "2026-02-12 18:36"
  },
  {
    "role": "michelle",
    "text": "I cooked adobo for her, it's a Filipino dish of pork with soy sauce and vinegar haha ",
    "time": "2026-02-12 18:38"
  },
  {
    "role": "michelle",
    "text": "Honestly, it's tiring but I love my grandmother, so for me, my tiredness disappears when I see her happy haha",
    "time": "2026-02-12 18:38"
  },
  {
    "role": "you",
    "text": "that's really sweet, honestly. adobo sounds good too, i've heard of it but never tried it haha",
    "time": "2026-02-12 18:45"
  },
  {
    "role": "michelle",
    "text": "oh yes. actually, adobo is popular here in the philippines, but i don't like to eat it often. I rarely eat this, only on special occasions 😆",
    "time": "2026-02-12 18:51"
  },
  {
    "role": "you",
    "text": "haha wait so you cook it for her but you don't even like eating it yourself? that's dedication",
    "time": "2026-02-12 18:58"
  },
  {
    "role": "michelle",
    "text": "Actually, after I cooked at grandma's house earlier, I went home to cook food for my parents, so I didn't eat at grandma's house earlier, hehe",
    "time": "2026-02-12 19:03"
  },
  {
    "role": "you",
    "text": "adobo sounds really good, you gotta teach me how to make it sometime haha\n\nbtw random thought but i saw your story the other day.. the beach one? you looked really sexy honestly, had to do a double take 😏",
    "time": "2026-02-12 19:06"
  }
]