[
  {
    "role": "michelle",
    "text": "oh yes, every country has different beauty standards, so I just think that if I'm not attractive here, maybe I'll be attractive in another country 😂 ",
    "time": "2026-02-11 20:09"
  },
  {
    "role": "michelle",
    "text": "actually both, we do dance battle and music battle every month at school",
    "time": "2026-02-11 20:09"
  },
  {
    "role": "you",
    "text": "haha i mean you're probably attractive in a lot of places, just saying 😏\n\nwait dance AND music battles every month?? that's sick honestly. did you compete or just watch? \n\ni'm trying to imagine a cosmetics sales lady who can dance battle lmao",
    "time": "2026-02-11 20:14"
  },
  {
    "role": "michelle",
    "text": "oh thankyou for that 😁",
    "time": "2026-02-11 20:19"
  },
  {
    "role": "michelle",
    "text": " yes every month there is a dance and music battle at school here, i participate since i like to dance and sing. half of my time at school is practice for dancing 😂",
    "time": "2026-02-11 20:19"
  },
  {
    "role": "you",
    "text": "wait half your time?? 😂\n\nthat's commitment honestly. so you were like actually serious about it, not just messing around\n\ndo you still dance now or was that just a school thing?",
    "time": "2026-02-11 20:22"
  },
  {
    "role": "michelle",
    "text": "yes, our PE time lasts almost half the time of school hours 😂  ",
    "time": "2026-02-11 20:29"
  },
  {
    "role": "michelle",
    "text": "i still do dancing in competitions here in our area but if there is no competition i don't dance anymore haha",
    "time": "2026-02-11 20:29"
  },
  {
    "role": "you",
    "text": "wait so PE was like half your school day?? that's wild haha\n\noh nice so you still compete sometimes. what kind of competitions? like local street dance stuff or more organized events?",
    "time": "2026-02-11 20:37"
  },
  {
    "role": "michelle",
    "text": "yes, at our school, we are mentally and physically exhausted because of the activities 😂  ",
    "time": "2026-02-11 20:43"
  },
  {
    "role": "michelle",
    "text": "sometimes local street competition but often more organized events",
    "time": "2026-02-11 20:43"
  },
  {
    "role": "you",
    "text": "haha yeah i can imagine, dancing that much is no joke\n\noh cool so you actually compete in real events, that's pretty legit. when's the last time you did one?\n\nand do you still practice much or just kinda show up when there's a comp? 😂",
    "time": "2026-02-11 20:49"
  },
  {
    "role": "michelle",
    "text": "the last time i participated in the competition was last December in our municipality at the event there, Me and my other dance club friends won because the dance we did there was the one we danced at our school graduation so we didn't need to practice too much because we were already good at it haha ",
    "time": "2026-02-11 20:56"
  },
  {
    "role": "michelle",
    "text": "When there's an upcoming competition, I practice too much, especially when there are new dance moves that I need to learn 😂",
    "time": "2026-02-11 20:56"
  },
  {
    "role": "you",
    "text": "oh wait you won last december?? that's actually really cool, especially reusing the graduation dance haha, smart move\n\nand yeah i feel that, new choreography takes so much practice to get right. do you guys choreograph it yourselves or does someone teach you?",
    "time": "2026-02-11 21:50"
  },
  {
    "role": "michelle",
    "text": "oh yes exactly haha, actually what we do is I first learn the dance moves in advance, then after i learn i teach them haha",
    "time": "2026-02-11 21:58"
  },
  {
    "role": "michelle",
    "text": "maybe but for me I'm not a good dancer I just did my best and I just enjoyed dancing and didn't think i was in a competition so I didn't put pressure on myself 😂",
    "time": "2026-02-11 22:30"
  },
  {
    "role": "michelle",
    "text": "I don't have a bf, and the guys here are strict forward if they like the girl they will tell the girl immediately no matter what the girl is. someone is pursuing me here but i rejected him because he is too arrogant ",
    "time": "2026-02-11 22:34"
  },
  {
    "role": "you",
    "text": "oh interesting, so guys here are pretty direct huh\n\nhaha yeah arrogant guys are the worst. like there's confidence and then there's just... too much\n\nso you're single then? not really looking or just haven't found the right person yet?",
    "time": "2026-02-11 22:39"
  },
  {
    "role": "michelle",
    "text": "yes, im still single because i don't like the attitude of the men here, most of them are arrogant so if you rejected them they will tell you that \"youre lucky because i chose you but you rejected me\" I experienced that with four men as if it was my fault that they confessed to me 😂",
    "time": "2026-02-11 22:42"
  },
  {
    "role": "you",
    "text": "haha i like that mindset though, just enjoying it without the pressure. probably why you do well actually\n\nthat's kinda the best way to perform honestly, when you're not overthinking",
    "time": "2026-02-11 22:43"
  },
  {
    "role": "you",
    "text": "wait four guys said that to you?? 😂\n\nthat's such a wild mentality honestly. like \"you should be grateful i even noticed you\" ... yeah no wonder you rejected them lmao\n\nsounds exhausting dealing with that honestly",
    "time": "2026-02-11 22:48"
  },
  {
    "role": "michelle",
    "text": "yes, it's better to be single with freedom in everything. just based on my experience haha, since in my last relationship he was very strict with me, almost everything I did was forbidden or wrong",
    "time": "2026-02-11 22:48"
  },
  {
    "role": "you",
    "text": "damn that sounds rough honestly. like he was controlling everything? that's not a relationship, that's a prison lol\n\nyou deserve way better than that. someone who actually respects you and lets you be yourself\n\nglad you got out of that though. makes sense why you value your freedom now",
    "time": "2026-02-11 23:14"
  },
  {
    "role": "michelle",
    "text": "oh yes it's really a blessing to me that he cheated because that's why i woke up to reality and left him right away, since i was so stupid when it comes to love i always hold on to things so it's hard for me to let go haha",
    "time": "2026-02-11 23:24"
  },
  {
    "role": "michelle",
    "text": "yes and because of my past i dont have any standard when dating a man, it doesn't matter if he is rich or poor, and looks don't matter either. all i want is kind and respectful haha",
    "time": "2026-02-11 23:38"
  },
  {
    "role": "you",
    "text": "honestly that's such a good standard to have. like kind and respectful sounds basic but it's actually what matters most\n\nlots of people get distracted by looks or money or whatever but at the end of the day if someone treats you like shit none of that matters lol\n\nso yeah makes sense after what you went through. you know what you want now",
    "time": "2026-02-11 23:44"
  },
  {
    "role": "michelle",
    "text": "yes exactly haha, and you, are you in a relationship?",
    "time": "2026-02-11 23:50"
  },
  {
    "role": "you",
    "text": "nah i'm single too actually\n\nlol kinda funny we're both in the same boat here. though your reasons sound way more dramatic than mine 😂\n\nmine's more just... work's busy, haven't really met anyone interesting in a while. plus dating apps here are kinda exhausting honestly",
    "time": "2026-02-12 00:04"
  },
  {
    "role": "michelle",
    "text": "ohh i got it we're same hahaha, and yes the dating app is also tiring, I actually tried it, but the people I talk to are not consistent. I mean, they just disappear for a few days and never come back 😂",
    "time": "2026-02-12 00:11"
  }
]