[
  {
    "role": "michelle",
    "text": "oh yes it's really a blessing to me that he cheated because that's why i woke up to reality and left him right away, since i was so stupid when it comes to love i always hold on to things so it's hard for me to let go haha",
    "time": "2026-02-11 23:24"
  },
  {
    "role": "michelle",
    "text": "yes and because of my past i dont have any standard when dating a man, it doesn't matter if he is rich or poor, and looks don't matter either. all i want is kind and respectful haha",
    "time": "2026-02-11 23:38"
  },
  {
    "role": "you",
    "text": "honestly that's such a good standard to have. like kind and respectful sounds basic but it's actually what matters most\n\nlots of people get distracted by looks or money or whatever but at the end of the day if someone treats you like shit none of that matters lol\n\nso yeah makes sense after what you went through. you know what you want now",
    "time": "2026-02-11 23:44"
  },
  {
    "role": "michelle",
    "text": "yes exactly haha, and you, are you in a relationship?",
    "time": "2026-02-11 23:50"
  },
  {
    "role": "you",
    "text": "nah i'm single too actually\n\nlol kinda funny we're both in the same boat here. though your reasons sound way more dramatic than mine 😂\n\nmine's more just... work's busy, haven't really met anyone interesting in a while. plus dating apps here are kinda exhausting honestly",
    "time": "2026-02-12 00:04"
  },
  {
    "role": "michelle",
    "text": "ohh i got it we're same hahaha, and yes the dating app is also tiring, I actually tried it, but the people I talk to are not consistent. I mean, they just disappear for a few days and never come back 😂",
    "time": "2026-02-12 00:11"
  },
  {
    "role": "you",
    "text": "yeah ghosting is so annoying honestly. like why match with someone if you're not even gonna talk haha\n\nguess it's the same everywhere, people just get bored or find someone else and don't bother saying anything",
    "time": "2026-02-12 08:19"
  },
  {
    "role": "michelle",
    "text": "yes, so many people in the dating apps are like this.  that's why i gave up finding someone on any app, all i talk to are the people who chat with me but if no one chats i dont talk to anyone haha",
    "time": "2026-02-12 10:06"
  },
  {
    "role": "you",
    "text": "haha yeah same, i gave up on those apps a while ago\n\nso you just vibe on your own until someone interesting comes along basically?",
    "time": "2026-02-12 10:20"
  },
  {
    "role": "michelle",
    "text": "yes, I just go with the flow, when someone chats, I'll talk until we're comfortable with each other",
    "time": "2026-02-12 10:27"
  },
  {
    "role": "you",
    "text": "haha yeah that's a good approach honestly, just let things happen naturally instead of forcing it",
    "time": "2026-02-12 10:35"
  },
  {
    "role": "michelle",
    "text": "yes, but sometimes when someone chats with me weirdly I don't reply, i mean, they fall in love so quickly it's almost unreal haha",
    "time": "2026-02-12 10:41"
  },
  {
    "role": "you",
    "text": "haha yeah i know the type, like \"i feel like i've known you forever\" after two messages 😂\n\ninstant red flag honestly",
    "time": "2026-02-12 10:51"
  },
  {
    "role": "michelle",
    "text": "exactly, when i feel like someone is red flagging me, i walk away hahaha because talking to red flag people is just a waste of time 😂",
    "time": "2026-02-12 11:02"
  },
  {
    "role": "you",
    "text": "haha yeah smart move. life's too short to waste on people who don't get it",
    "time": "2026-02-12 11:13"
  },
  {
    "role": "michelle",
    "text": "actually ramen with rice is really my go-to, especially when I'm tired 😂",
    "time": "2026-02-12 11:27"
  },
  {
    "role": "you",
    "text": "haha ramen and rice together, that's a solid combo honestly. do you go for instant ramen or the real stuff from a shop?",
    "time": "2026-02-12 11:44"
  },
  {
    "role": "michelle",
    "text": "haha yeah, it's really a solid combo 😂 sometimes i go for instant ramen, but more often i get the real stuff from a shop. \n",
    "time": "2026-02-12 11:52"
  },
  {
    "role": "michelle",
    "text": "what time did you usually go for lunch ",
    "time": "2026-02-12 11:53"
  },
  {
    "role": "you",
    "text": "usually around 12 or 12:30, depends on work stuff\n\nwhy, you hungry? haha",
    "time": "2026-02-12 12:16"
  },
  {
    "role": "michelle",
    "text": "ohh okayy i see haha, no  i usually eat lunch at 1pm because our break time is 1pm haha",
    "time": "2026-02-12 12:25"
  },
  {
    "role": "you",
    "text": "ah makes sense, that's pretty late lunch though haha. you must get pretty hungry by then",
    "time": "2026-02-12 12:36"
  },
  {
    "role": "michelle",
    "text": "yes, that's why before I leave the house I make sure I'm full so I'm not too hungry before break time haha",
    "time": "2026-02-12 12:53"
  },
  {
    "role": "you",
    "text": "haha smart, basically carb loading before work\n\ndo you cook or just like eat a big breakfast?",
    "time": "2026-02-12 13:03"
  },
  {
    "role": "michelle",
    "text": "I cook, I always eat for breakfast and dinner, but for lunch I eat at the mall because I only have a 30 minute break at work haha",
    "time": "2026-02-12 13:19"
  },
  {
    "role": "you",
    "text": "ahh makes sense, 30 minutes isn't much time to do anything haha. what do you usually get at the mall?",
    "time": "2026-02-12 13:28"
  },
  {
    "role": "michelle",
    "text": "hmm.. you mean for lunch? sometimes at mcdonalds but often jollibee",
    "time": "2026-02-12 14:42"
  },
  {
    "role": "you",
    "text": "ah jollibee, i've heard about that place actually haha. never been though since we don't have it here",
    "time": "2026-02-12 14:51"
  },
  {
    "role": "michelle",
    "text": "oh yes, but this is just a Filipino version of mcdo so they don't have anything different, maybe just the taste of gravy and ketchup 😂",
    "time": "2026-02-12 14:55"
  },
  {
    "role": "you",
    "text": "haha the gravy and ketchup make that much of a difference?",
    "time": "2026-02-12 15:31"
  }
]