[
  {
    "role": "michelle",
    "text": "oh yes, but this is just a Filipino version of mcdo so they don't have anything different, maybe just the taste of gravy and ketchup 😂",
    "time": "2026-02-12 14:55"
  },
  {
    "role": "you",
    "text": "haha the gravy and ketchup make that much of a difference?",
    "time": "2026-02-12 15:31"
  },
  {
    "role": "michelle",
    "text": "yes for me, jollibee's gravy and ketchup are tastier than mcdo's haha",
    "time": "2026-02-12 16:00"
  },
  {
    "role": "you",
    "text": "haha fair enough, guess the condiments really do matter then",
    "time": "2026-02-12 16:20"
  },
  {
    "role": "michelle",
    "text": "yea yea, i'm on my way home now i'm only at work for half a day today haha",
    "time": "2026-02-12 16:23"
  },
  {
    "role": "you",
    "text": "oh nice, heading home early then haha. going straight to the beach after or just relaxing at home?",
    "time": "2026-02-12 16:47"
  },
  {
    "role": "michelle",
    "text": "I went to my grandma's house to cook dinner for her and I just finished cleaning the house 😂",
    "time": "2026-02-12 18:18"
  },
  {
    "role": "you",
    "text": "oh that's really sweet of you, taking care of your grandma like that. you're a good granddaughter haha",
    "time": "2026-02-12 18:23"
  },
  {
    "role": "michelle",
    "text": "yes I do this to her every day since I don't want my grandma to get tired, she should just relax all the time haha",
    "time": "2026-02-12 18:25"
  },
  {
    "role": "you",
    "text": "that's really sweet, she's lucky to have you haha. must be tiring some days though?",
    "time": "2026-02-12 18:36"
  },
  {
    "role": "michelle",
    "text": "I cooked adobo for her, it's a Filipino dish of pork with soy sauce and vinegar haha ",
    "time": "2026-02-12 18:38"
  },
  {
    "role": "michelle",
    "text": "Honestly, it's tiring but I love my grandmother, so for me, my tiredness disappears when I see her happy haha",
    "time": "2026-02-12 18:38"
  },
  {
    "role": "you",
    "text": "that's really sweet, honestly. adobo sounds good too, i've heard of it but never tried it haha",
    "time": "2026-02-12 18:45"
  },
  {
    "role": "michelle",
    "text": "oh yes. actually, adobo is popular here in the philippines, but i don't like to eat it often. I rarely eat this, only on special occasions 😆",
    "time": "2026-02-12 18:51"
  },
  {
    "role": "you",
    "text": "haha wait so you cook it for her but you don't even like eating it yourself? that's dedication",
    "time": "2026-02-12 18:58"
  },
  {
    "role": "michelle",
    "text": "Actually, after I cooked at grandma's house earlier, I went home to cook food for my parents, so I didn't eat at grandma's house earlier, hehe",
    "time": "2026-02-12 19:03"
  },
  {
    "role": "you",
    "text": "haha wow so you cooked for your grandma then went home and cooked again for your parents? you're basically a full-time chef at this point",
    "time": "2026-02-12 19:10"
  },
  {
    "role": "michelle",
    "text": "oh when I went to the beach last time haha, i had many pics in the beach these past few months while wearing a differents bikinis. maybe i'll send you later since it's on my other phone hahaha ",
    "time": "2026-02-12 19:15"
  },
  {
    "role": "michelle",
    "text": "yes, but it's okay because cooking is one of my hobbies haha",
    "time": "2026-02-12 19:15"
  },
  {
    "role": "you",
    "text": "wait you're sending bikini pics? haha okay now I'm curious",
    "time": "2026-02-12 19:22"
  },
  {
    "role": "michelle",
    "text": "oh I just open it again 😆",
    "time": "2026-02-13 12:54"
  },
  {
    "role": "michelle",
    "text": "have you eaten?",
    "time": "2026-02-13 12:57"
  },
  {
    "role": "you",
    "text": "haha yeah just been busy with work. nah not yet, probably gonna grab something soon though. you?",
    "time": "2026-02-13 13:02"
  },
  {
    "role": "you",
    "text": "yeah just finished eating actually haha. had some curry rice from the konbini, nothing fancy",
    "time": "2026-02-13 13:06"
  },
  {
    "role": "michelle",
    "text": "ohh okay okay got it haha, i haven't eaten yet. i'm still cooking lunch. since I need to cook a lot now because there are guests coming here haha",
    "time": "2026-02-13 13:09"
  },
  {
    "role": "you",
    "text": "oh nice, guests on a wednesday? haha must be something special",
    "time": "2026-02-13 13:34"
  },
  {
    "role": "michelle",
    "text": "yes actually my fam from another province will be visiting here for the celebration tomorrow for valentines day so i have no choice but to not go to work for 2 days 😆",
    "time": "2026-02-13 13:47"
  },
  {
    "role": "you",
    "text": "oh wait so you're off for valentines day haha. family taking priority over the cosmetics store I see 😆",
    "time": "2026-02-13 14:10"
  },
  {
    "role": "michelle",
    "text": "hahaha yes, here valentines day is important so i want to celebrate it with my fam since i dont have a bf here 😂",
    "time": "2026-02-13 14:22"
  },
  {
    "role": "you",
    "text": "haha fair enough. btw random question, what's your type anyway? like what kinda guy actually catches your attention",
    "time": "2026-02-13 14:55"
  }
]